Revit 2024 API
Mullion.MullionType Property
 The MullionType style of this Mullion. Get - to access type of mullion Set - change type of mullion. If the mullion is locked, InvalidOperationException exception will be thrown.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public MullionType MullionType { get; set; }
Visual Basic
Public Property MullionType As MullionType
	Get
	Set
Visual C++
public:
property MullionType^ MullionType {
	MullionType^ get ();
	void set (MullionType^ value);
}
See Also
Mullion Class
Autodesk.Revit.DB Namespace